a = {1,2,3,4,5} # создали множество
b = frozenset(a) # заморозили множество а не можем его изменять!!
# : Создать список, состоящий из четных чисел в диапазоне от 1 до 100
# Первый вариант решения
list_1 = []
for i in range(1, 101):
    list_1.append(i)
print(list_1) # [1, 2, 3,..., 100]

#второй вариант решения
list_1 = [i for i in range(1, 101)] # [1, 2, 3,..., 100] все числа
list_1 = [i for i in range(1, 101) if i % 2 == 0] # [2, 4, 6,..., 100] четные 
list_1 = [(i, i) for i in range(1, 101) if i % 2 == 0] # [(2, 2), (4, 4),...,(100, 100)] # кортеж
list_1 = [i * 2 for i in range(10) if i % 2 == 0] # умножаем значение на 2
print(list_1) # [0, 4, 8, 12, 16]

