list_1 = [1,2,3,4,5,6,7,8,9,10]
print(list_1[0]) #1
print(list_1[1]) #2
print(list_1[len(list_1)-1]) #10 последний элемент
print(list_1[-5]) #6
print(list_1[:]) # [1,2,3,4,5,6,7,8,9,10] выводит все числа с начала до конца
print(list_1[:2]) # [1,2] начинаем с начала и выводим до 2 индекса не включая последний
print(list_1[len(list_1)-2:]) # [9,10] выводим с конца последние 2 элемента
print(list_1[2:9]) # [3,4,5,6,7,8,9] выводим элементы с 2 индекса по 9 не включая последний
print(list_1[6:-18]) # []
print(list_1[0:len(list_1):6]) # выводим с начала(0) с шагом 6 до конца [1,7]
print(list_1[::6]) #  выводим с начала(0) с шагом 6 до конца [1,7]