# Напишите программу для печати всех уникальных значений в словаре. 
# Input: {"V": "S001", "V": "S002", "VI": "S001", "VI": "S005", "VII": " S005 ",
# " V ":" S009 ", " VIII ":" S007 ", "IV":"holla", "1234": "S005"}
# Примечание: Список словарей задан изначально.  Пользователь его не вводит
test_list = {"V": "S001", "V": "S002", "VI": "S001", "VI": "S005", "VII": " S005 ", " V ":" S009 ", " VIII ":" S007 ", "IV":"holla", "1234": "S005"}
#res = list(set(val for dic in test_list for val in dic.values()))
a = set() # сет это уникальные значения создали пустое множество

for value in test_list.values(): #идем ТОЛЬКО значениями из test_list с помощью values. КЛЮЧИ НАС НЕ ИНТЕРЕСУЮТ!!  перебираем только значения!!!!! ключи нет 
    a.add(value) # засовываем в а уникальные значения из тест листа

print(a)